Repository: xificurk/keelsbot
Catalog: locale/*/LC_MESSAGES/keelsbot.po
Languages: cs

source: Using JID {}.
cs: Používám JID {}.

source: Disconnecting the bot.
cs: Odpojuji bota.

source: EVENT: {}
cs: UDÁLOST: {}

source: Command {!r} with args {!r}
cs: Příkaz {!r} s argumenty {!r}

source: Using {!r} for JID {}.
cs: Používám {!r} pro JID {}.

source: Registering bot plugin {!r}.
cs: Registruji {!r} plugin bota.

source: Bot plugin {!r} is already registered.
cs: {!r} plugin bota je již registrován.

source: Expected module, string, or None for module argument, {} given.
cs: Očekáván modul, string, nebo None jako module argument, ale byl předán {}.

source: Bot plugin {!r} needs SleekXMPP plugin {!r}.
cs: {!r} plugin bota potřebuje SleekXMPP plugin {!r}.

source: Loading of bot plugin {!r} FAILED.
cs: Načtení {!r} pluginu bota SELHALO.

source: Deregistering bot plugin {!r}.
cs: Ruším {!r} plugin bota.

source: Calling the shutdown method of bot plugin {!r}.
cs: Volám shutdown metodu {!r} pluginu bota.

source: Usage
cs: Použití

source: Cleaning bot configuration before reload.
cs: Resetuji konfiguraci bota před znovunačtením.

source: Reloading bot configuration.
cs: Znovu načítám konfiguraci bota.

source: Restarting the bot.
cs: Restartuji bota.

source: Ignoring MUC with empty room attribute.
cs: Ignoruji MUC s prázdným atributem room.

source: Re-syncing with required MUC rooms.
cs: Synchronizuji přítomnost v MUC místnostech.

source: Leaving MUC room {!r}.
cs: Opouštím MUC místnost {!r}.

source: Joining MUC room {!r} as {!r}.
cs: Vstupuji do místnosti {!r} jako {!r}.

source: Loading configuration.
cs: Načítám konfiguraci bota.

source: No storage element found in config file - proceeding with no persistent storage, plugin behaviour may be undefined.
cs: V konfiguraci nebyl nalezen storage element - pokračuji bez trvalého uložiště, některé pluginy mohou selhat.

source: Configuring SleekXMPP plugins.
cs: Registruji SleekXMPP pluginy.

source: Ignoring unnamed SleekXMPP plugin.
cs: Ignoruji nepojmenovaný SleekXMPP plugin.

source: Configuring bot plugins.
cs: Registruji {} plugin bota.

source: Ignoring unnamed bot plugin.
cs: Ignoruji nepojmenovaný plugin bota.

source: Adding bot plugin {!r}.
cs: Přidávám {!r} plugin bota.

source: disable usage of colored output
cs: vypnout používání barevného výstupu

source: set logging to ERROR
cs: nastavit úroveň logování na ERROR

source: set logging to INFO
cs: nastavit úroveň logování na INFO

source: set logging to DEBUG
cs: nastavit úroveň logování na DEBUG

source: set logging to ALL
cs: nastavit úroveň logování na ALL

source: path to config file
cs: umístění konfiguračního souboru

source: You need at least Python {} to run this script.
cs: Tento skript vyžaduje Python verze {}, nebo vyšší.

source: Config file {!r} not found.
cs: Konfigurační soubor {!r} nenalezen.

source: Reload
cs: Znovunačtení konfigurace

source: Reload the bot configuration and apply changes without disconnecting.
cs: Znovu načíst konfiguraci a pluginy bota aniž by se odpojil z jabberu.

source: Completely restart the bot.
cs: Restartovat bota a znovu připojit.

source: Die
cs: Umřít

source: Kill the bot.
cs: Killnout bota.

source: Log level
cs: Úroveň logování

source: Set the level of logging.
cs: Nastavit úroveň logování.

source: User level
cs: Level uživatele

source: Display user's access level.
cs: Vypíe úrove pístupu odesilatele.

source: Reloaded, boss.
cs: Znovu načteno, šéfiku.

source: You must input the number in range 0-50, or one of the values {}.
cs: Musíš zadat číslo v rozmezí 0-50, nebo jednu z hodnot {}.

source: Log level changed...
cs: Úroveň logování změněna...

source: You're on level {}.
cs: Jsi na levelu {}.

source: Configuration error - type attribute of limit required and must be one of {}.
cs: Chybná konfigurace - type atribut je vyžadován pro limit a musí být z {}.

source: Configuration error - {} attribute of limit required and must be digit.
cs: Chybná konfigurace - číselný {} atribut je vyžadován pro limit.

source: Configuration error - no limits given.
cs: Chybná konfigurace - nebyly nastaveny žádné limity.

source: Configuration error - room attribute of muc required.
cs: Chybná konfigurace - room atribut je vyžadován pro muc.

source: Enabling spam protection in room {}.
cs: Zapínám protekci proti spamu v místnosti {}.

source: Warning {!r} in room {}.
cs: Varuji {!r} v místnosti {}.

source: Stop spamming!
cs: Nespamuj!

source: Kicking {!r} from room {}.
cs: Kickuju {!r} z místnosti {}.

source: Banning {!r} from room {}.
cs: Banuju {!r} v místnosti {}.

source: Got {} users in history and {} in spammers.
cs: Zůstalo {} uživatelů v historii a {} ve spammerech.

source: Definition
cs: Definice

source: Stores (or deletes) the definition in database.
cs: Uloží (příp. smaže) definici do databáze.

source: multiword expression = [definition]
cs: víceslovný název = [definice]

source: Definition with lock
cs: Definice se zámkem

source: Stores (or deletes) the definition in database and locks the definition against change by users with lower privileges than the author.
cs: Uloží (příp. smaže) definici do databáze a uzamkne ji proti editaci uživateli s nižšími právy než autor.

source: Display definition
cs: Zobrazí definici

source: Display the definition stored in database
cs: Vrátí uloženou definici z databáze.

source: multiword expression
cs: víceslovný název

source: Didn't you forget something?
cs: Něco ti tam chybí, šéfiku!

source: You must specify what term you want to define!
cs: Musíš zadat, co chceš definovat!

source: Sorry, you don't have permission to edit this definition.
cs: Sorry, ale na tuhle editaci nemáš právo.

source: Deleted (if there even was something ;-))
cs: Smazáno (pokud to tam teda bylo ;-))

source: I have no idea, who or what is {}.
cs: Vůbec netuším, kdo nebo co je {}.

source: Updating definiton of {!r} with level {}.
cs: Aktualizuji definici {!r} s levelem {}.

source: Deleting definition of {!r}.
cs: Mažu definici {!r}.

source: Configuration error - jid attribute of subscriber required.
cs: Chybná konfigurace - jid atribut vyžadován pro subscriber.

source: Configuration error - no subscribers given.
cs: Chybná konfigurace - nebyli nastaveni žádní adresáti.

source: Configuration error - url attribute of feed required.
cs: Chybná konfigurace - url atribut vyžadován pro feed.

source: Scheduling {!r} feed check every {} minutes.
cs: Plánuji kontrolu feedu {!r} každých {} minut.

source: Entering feed loop.
cs: Startuji smyčku feedu.

source: Checking feed {}.
cs: Kontroluji feed {}.

source: Found new item {!r} in feed {}.
cs: Nalezl jsem novou položku {!r} ve feedu {}.

source: Exiting feed loop.
cs: Končím smyčku feedu.

source: Entering message loop.
cs: Startuji smyčku zpráv.

source: Cannot send feed alert, the bot is not in room {!r}.
cs: Nemůžu poslat upozornění o feedu, bot nesedí v místnosti {!r}.

source: Exiting message loop.
cs: Končím smyčku zpráv.

source: Storing new item {} in feed {}.
cs: Ukládám novou položku {} z feedu {}.

source: Error occured while checking feed {}.
cs: Nastala chyba během kontrolování feedu {}.

source: Help
cs: Nápověda

source: If no topic was given, display the list of available commands and other help topics. Otherwise display the help for a given topic.
cs: Pokud nebylo určeno téma, vypíše seznam dostupných příkazů a dalších možných témat nápovědy. V opačném případě vypíše nápovědu na dané téma.

source: [command/topic]
cs: [příkaz/téma]

source: Commands
cs: Příkazy

source: Display list of available commands.
cs: Vypíše seznam dostupných příkazů.

source: Available commands
cs: Dostupné příkazy

source: Other available help topics
cs: Další témata nápovědy

source: Don't know...
cs: Neznám, neumím...

source: NOT starting to chat in room {}
cs: NEzačínám se vykecávat v místnosti {}

source: Starting to chat in room {}
cs: Začínám se vykecávat v místnosti {}

source: Configuration error - path attribute of dictionary required.
cs: Chybná konfigurace - path atribut vyžadován pro dictionary.

source: Disable chatbot in MUC
cs: Vypnout chatbota v MUC

source: Bot stops replying in public chat of given (or current) MUC.
cs: Bot se přestane vykecávat v zadaném (příp. v tomto) MUC.

source: [room@server]
cs: [místnost@server]

source: Enable chatbot in MUC
cs: Zapnout chatbota v MUC

source: Bot starts replying in public chat of given (or current) MUC.
cs: Bot se začne vykecávat v zadaném (příp. v tomto) MUC.

source: Reload conversation files
cs: Znovunačíst soubory s konverzacemi

source: Reloads conversation files without dropping out of MUC or forgetting current state.
cs: Znovu načte soubory s konverzacemi aniž by opustil MUC nebo zapomněl současný stav konverzací.

source: OK, I'll start chatting in room {}.
cs: OK, začnu se vykecávat v místnosti {}.

source: Sorry, I can't chat in room {} at all.
cs: V místnosti {} se vůbec nemůžu vykecávat.

source: OK, I'll stop chatting in room {}.
cs: OK, přestanu se vykecávat v místnosti {}.

source: Sorry, I don't chat in room {} at all.
cs: V místnosti {} já ale vůbec nekecám.

source: Conversation files reloaded.
cs: Soubory s konverzacemi znovu načteny.

source: OK, I've reloaded conversation files ;-)
cs: OK, soubory s konverzacemi znovu načteny ;-)

source: Filter error: {}.
cs: Chyba filtru: {}.

source: Loading conversation file {}.
cs: Načítám soubor s konverzacemi {}.

source: Regular expression error: {!r}.
cs: Chyba regulárního výrazu: {!r}.

source: Could not find matching element with id {!r}.
cs: Nepodařilo se nalézt element s id {!r}.

source: Getting response for {!r}.
cs: Hledám odpověď pro {!r}.

source: Got {} queries left from {}, {}, {}.
cs: Zůstalo {} dotazů z {}, {}, {}.

source: Randomly choosing from {} choices (weight sum {}).
cs: Náhodně vybírám z {} možností (suma váh {}).

source: Configuration error - room attribute of log required.
cs: Chybná konfigurace - room atribut vyžadován pro log.

source: Starting logging of room {!r} to file {}.
cs: Začínám logovat místnost {!r} do souboru {}.

source: Configuration error - file attribute of log required.
cs: Chybná konfigurace - file atribut vyžadován pro log.

source: has been kicked
cs: byl vykpnut

source: has been banned
cs: byl zabanován

source: Openning log file {!r}.
cs: Otvírám soubor s logem {!r}.

source: Logging started
cs: Začátek logování

source: Subject has been set to
cs: Téma bylo nastaveno na

source: has set the subject to
cs: nastavil téma na

source: has joined the room as
cs: vstoupil do místnosti jako

source: has left the room
cs: opustil místnost

source: Current number of users in room
cs: Počet uživatelů v místnosti

source: Display current number of users in MUC room.
cs: Zobrazí současný počet uživatelů v MUC místnosti.

source: Highest number of users in room
cs: Nejvyšší počet uživatelů v místnosti

source: Display historically highest number of users in MUC room.
cs: Zobrazí historicky nejvyšší počet uživatelů v místnosti a datum, kdy k tomu došlo.

source: There is historically highest number of users in the room ({}).
cs: V místnosti je historicky nejvyšší počet uživatelů ({}).

source: There is currently {} user present in the room.
cs: Momentálně tu vidím {} uživatele.

source: Historically highest number of users was recorded {:%m/%d/%y (%H:%M)}, {} user was present.
cs: Nejvíc narváno tu bylo v {:%H:%M %d.%m.%Y}, to jsem tu viděl {} uživatele.

source: Updating muc_presence record for {}.
cs: Aktualizuji muc_presence záznam pro {}.

source: Rejoining the room {} as {!r}.
cs: Znovu se připojuji do {} jako {!r}.

source: Entering the loop.
cs: Startuji smyčku.

source: Exiting the loop.
cs: Končím smyčku.

source: Send message into MUC
cs: Zaslat zprávu do MUCu

source: Bot sends the groupchat message into the specified MUC.
cs: Bot odešle zprávu do veřejného chatu zadaného MUC.

source: room@server text
cs: místnost@server text

source: Send message to JID
cs: Zaslat zprávu do JID

source: Bot sends the message to the specified JID.
cs: Bot odešle zprávu zadanému JID.

source: user@server text
cs: uzivatel@server text

source: You've forgot to specify the MUC.
cs: Zapomněl jsi napsat adresu MUCu.

source: I'm not in the room {}.
cs: V místnosti {} já vůbec nejsem.

source: Sent
cs: Odesláno

source: You've forgot to specify the JID.
cs: Zapomněl jsi napsat jabber adresu.

source: Sends code snippet to pastebin.com At first line are optional arguments separated by space in an arbitrary order - expiration (10M = 10 minutes, 1H = 1 hour, 1D = 1 day, 1M = 1 month, N = never), langauge format (see http://pastebin.com/api) and whether to send the link directly to MUC (1, defaults to 0 = send the link back to user). Default expiration is
cs: Odešle kód na pastebin.com. Na prvním řádku bere v libovolném pořadí volitelné parametry oddělené mezerou - platnost (10M = 10 minut, 1H = 1 hodina, 1D = 1 den, 1M = 1 měsíc, N = navždy), název jazyku (podle http://pastebin.com/api.php), a zda odeslat vygenerovaný odkaz přímo do veřejného chatu (1, výchozí hodnota je 0, tzn. poslat odkaz zpátky odkud přišel požadavek). Výchozí hodnota platnosti je

source: and language
cs: a jazyku

source: All other lines are treated as code content.
cs: Na všech dalších řádcích je samotný kód.

source: code
cs: kód

source: Invalid input, see help.
cs: Neplatné zadání, mrkni na !help paste.

source: Unexpected response:
cs: Neočekávaná odpověď:

source: Unexpected error while getting pastebin URL.
cs: Neočekávaná chyba při získávání pastebin URL.

source: ERROR
cs: CHYBA

source: {} sent code snippet {}
cs: {} vložil {}

source: User last seen
cs: Uživatele naposledy spatřen

source: Display the last sighting of the user in MUC room.
cs: Kdy byl zadaný uživatel naposledy spatřen v místnosti?

source: nick
cs: přezdívka

source: I'm not in room {}, so I can't track users activity there.
cs: Nesedím v místnosti {}, takže nevím. ;-)

source: You have to tell me about whom you want information!
cs: Lamo! Musíš napsat, o kom chceš informace! ;-)

source: {} idles in the room.
cs: {} idlí v místnosti.

source: {} idles in the room for {}.
cs: {} idlí v místnosti {}.

source: {}? I have no idea about whom you're talking...
cs: {}? Vůbec netuším, o kom je řeč...

source: It's {} since I last saw {} in the room.
cs: Už je to {}, co jsem v místnosti viděl {}.

source: already {} month
cs: už {} měsíc

source: already {} day
cs: už {} den

source: and
cs: a

source: already {} hour
cs: už {} hodinu

source: already {} minute
cs: už {} minutu

source: already {} second
cs: už {} sekundu

source: Updating seen record for {!r} in {}.
cs: Aktualizuji seen záznam pro {!r} v {}.

source: Return the message processed by Texy! If not message is given, return Texy! version.
cs: Zpracuje zprávu pomocí Texy! Pokud není předána žádná zpráva, vypíše verzi Texy!

source: [message]
cs: [zpráva]

source: Could not process: {}
cs: Chyba při zpracování: {}

source: Unexpected error while getting twitter status {}.
cs: Neočekávaná chyba při získávání twitter statusu {}.

source: Bot's uptime
cs: Uptime bota

source: Time since the last bot reload.
cs: Čas od posledního reloadu bota.

source: I'm up {}.
cs: Jsem vzhůru už {}.

source: Create dictionary
cs: Vytvořit slovník

source: Creates dictionary for storing phrase translations between lang1 and lang2
cs: Vytvoří slovník pro ukládání překladů slovíček mezi jazyk1 a jazyk2.

source: lang1 lang2
cs: jazyk1 jazyk2

source: List of dictionaries
cs: Seznam slovníků

source: Display the list of dictionaries.
cs: Zobrazí seznam slovníků.

source: Add phrase
cs: Přidat slovíčko

source: Stores the translation of the phrase.
cs: Uloží překlad slovíčka.

source: lang1 lang2 phrase1 ([note1]) phrase2 ([note2])
cs: jazyk1 jazyk2 slovíčko1 ([poznámka1]) slovíčko2 ([poznámka2])

source: Delete phrase
cs: Smazat slovíčko

source: Deletes the translation of the phrase.
cs: Smaže překlad slovíčka.

source: lang1 lang2 phrase1 () phrase2
cs: jazyk1 jazyk2 slovíčko1 () slovíčko2

source: List vocabulary
cs: Seznam slovíček

source: Display the list of stored translations in the dictionary.
cs: Zobrazí seznam uložených frází v daném slovníku.

source: Start test
cs: Začít test

source: Starts the test of phrase translations lang1 > lang2.
cs: Začne test ze znalosti slovíček jazyk1 > jazyk2.

source: Stop test
cs: Ukončit test

source: Stops the current test.
cs: Zastaví právě probíhající test.

source: WRONG! Correct answer: {}
cs: CHYBA! Správně: {}

source: This dictionary already exists.
cs: Tento slovník už existuje.

source: Dictionary {} - {} created.
cs: Slovník {} - {} vytvořen.

source: No dictionaries found.
cs: Nenalezeny žádné slovníky.

source: Dictionaries
cs: Slovníky

source: Saved.
cs: Uloženo.

source: Deleted.
cs: Smazáno.

source: This dictionary does not exist.
cs: Tento slovník neexistuje.

source: No phrases in dictionary {} - {}.
cs: Žádná slovíčka ve slovníku {} - {}.

source: Vocabulary from dictionary {} - {}
cs: Slovíčka ze slovníku {} - {}

source: The dictionary is empty!
cs: Slovník je prázdný!

source: You must supply names of two languages separated by space.
cs: Musíš zadat dva jazyky oddělené mezerou.

source: Invalid format.
cs: Neplatný formát.
